; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v4 - type_3 ?v7 - type_2)
 	      (pred_1 ?v6 - object ?v7 - type_2)
	      (pred_2 ?v4 - type_3 ?v8 - type_1)
	      (pred_4 ?v4 - type_3 ?v6 - object ?v8 - type_1))

   (:action op_1
       :parameters  (?v4 - type_3 ?v1 ?v2 - type_2)
       :precondition (and  (pred_3 ?v4 ?v1))
       :effect (and  (pred_3 ?v4 ?v2)
		     (not (pred_3 ?v4 ?v1))))

   (:action op_2
       :parameters (?v4 - type_3 ?v3 - object ?v5 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_1 ?v3 ?v5) (pred_3 ?v4 ?v5) (pred_2 ?v4 ?v8))
       :effect (and (pred_4 ?v4 ?v3 ?v8)
		    (not (pred_1 ?v3 ?v5)) 
		    (not (pred_2 ?v4 ?v8))))

   (:action op_3
       :parameters (?v4 - type_3 ?v3 - object ?v5 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_4 ?v4 ?v3 ?v8) (pred_3 ?v4 ?v5))
       :effect (and (pred_1 ?v3 ?v5)
		    (pred_2 ?v4 ?v8)
		    (not (pred_4 ?v4 ?v3 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_07 obj_01 - type_3
obj_04 obj_06 obj_12 obj_02 - type_1
obj_08 obj_10 obj_05 - type_2
obj_11 obj_09 obj_03 - object)
(:init
(pred_3 obj_07 obj_08)
(pred_2 obj_07 obj_04)
(pred_2 obj_07 obj_06)
(pred_3 obj_01 obj_10)
(pred_2 obj_01 obj_12)
(pred_2 obj_01 obj_02)
(pred_1 obj_11 obj_10)
(pred_1 obj_09 obj_10)
(pred_1 obj_03 obj_08)
)
(:goal
(and
(pred_1 obj_11 obj_08)
(pred_1 obj_09 obj_10)
(pred_1 obj_03 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_07 obj_08) (pred_3 obj_01 obj_08))))
  )
)
)

; plan
1. (op_2 obj_01 obj_11 obj_10 obj_02)
   deleted: (pred_1 obj_11 obj_10) (pred_2 obj_01 obj_02)
   added: (pred_4 obj_01 obj_11 obj_02)
   goals met: 2 of 3
2. (op_1 obj_07 obj_08 obj_10)
   deleted: (pred_3 obj_07 obj_08)
   added: (pred_3 obj_07 obj_10)
   goals met: 2 of 3
3. (op_1 obj_01 obj_10 obj_08)
   deleted: (pred_3 obj_01 obj_10)
   added: (pred_3 obj_01 obj_08)
   goals met: 2 of 3
4. (op_3 obj_01 obj_11 obj_08 obj_02)
   deleted: (pred_4 obj_01 obj_11 obj_02)
   added: (pred_1 obj_11 obj_08) (pred_2 obj_01 obj_02)
   goals met: 3 of 3
